[
  {
    "job_position": "Analista I - Desarrollador Senior",
    "working_period": "Dic 2024 - Actualmente",
    "job_enterprice": "Nequi",
    "job_enterprice_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Nequi_logo.svg/1200px-Nequi_logo.svg.png",
    "job_enterprice_link": "https://www.nequi.com/",
    "skills": [
      "Angular",
      "Ionic",
      "TypeScript",
      "RxJS",
      "NgRx",
      "HTML5",
      "SCSS",
      "Tailwind CSS",
      "Figma",
      "AWS",
      "Azure DevOps",
      "ESLint",
      "OpenSearch",
      "Git",
      "GitHub",
      "Jira",
      "Postman",
      "Clean Code"
    ],
    "description-business": "Nequi es la cuenta digital de Bancolombia que ofrece servicios financieros innovadores, accesibles y 100 % digitales a través de su aplicación móvil. Permite realizar transacciones, pagos, recargas y préstamos de manera ágil y segura, simplificando la gestión de finanzas personales.",
    "job_description": "Como miembro de la célula de Moneda Extranjera en Nequi, desarrollo e implemento integraciones con las APIs de PayPal y Payoneer para habilitar procesos de recepción de divisas. Diseño flujos de pago seguros y eficientes, optimizo la experiencia de usuario en web y móvil utilizando Angular e Ionic, y participo en la definición de requisitos técnicos. Garantizo la calidad del código siguiendo estándares de Clean Code y git flow en GitHub, y colaboro en metodologías ágiles (planificación de sprints, revisión de código y despliegue continuo) mediante pipelines en AWS y Azure DevOps."
  },
  {
    "job_position": "Consultor Especialista en Nequi",
    "working_period": "Nov 2023 - Nov 2024",
    "job_enterprice": "SETI S.A.S",
    "job_enterprice_img": "https://pbs.twimg.com/profile_images/860196618209042432/KifSpWpu_400x400.jpg",
    "job_enterprice_link": "https://seti.com.co/",
    "skills": [
      "Angular",
      "Figma",
      "HTML5",
      "Sass",
      "Azure",
      "Ionic",
      "Jira",
      "Postman",
      "Git",
      "GitHub",
      "TypeScript",
      "Jest",
      "Clean Code"
    ],
    "description-business": "Apoyamos a las empresas en la aplicación efectiva de las TI con prácticas ágiles que entreguen resultados tangibles en plazos de tiempos cortos. Buscando mejorar la actividad principal de su negocio, disminuyendo costos y optimizando recursos.",
    "job_description": "Como Desarrollador Frontend en Nequi, aplico mi experiencia en Angular, Ionic Framework, y diseño responsivo con CSS y HTML para crear interfaces de usuario atractivas y funcionales. Utilizo Jest para pruebas unitarias asegurando la calidad y rendimiento del software, mientras que mi compromiso con los principios de Clean Code garantiza un código eficiente y mantenible. Mi enfoque práctico y actualizado en tecnologías de desarrollo web contribuye significativamente a la innovación y eficiencia de los proyectos en Nequi."
  },
  {
    "job_position": "Desarrollador FullStack Senior",
    "working_period": "Feb 2021 - Nov 2023",
    "job_enterprice": "TBTB GLOBAL",
    "job_enterprice_img": "https://pbs.twimg.com/profile_images/860196618209042432/KifSpWpu_400x400.jpg",
    "job_enterprice_link": "https://tbtb.global/",
    "skills": [
      "Angular",
      ".NET",
      "HTML5",
      "Sass",
      "Azure",
      "Ionic",
      "Jira",
      "Postman",
      "Git",
      "GitLab",
      "TypeScript",
      "C#",
      "SQL Server",
      "Jasmine",
      "Karma"
    ],
    "description-business": "Somos TBTB Global, una empresa dedicada a ayudar a otras empresas a mejorar sus negocios y el estilo de vida de los pacientes que padecen cáncer y enfermedades raras.",
    "job_description": "Mi destacado desempeño en la organización me ha permitido consolidar habilidades en IT tras un exitoso ascenso. He liderado proyectos impactantes en Suramérica, implementado metodologías ágiles como Scrum y XP, y fortalecido la seguridad con OWASP. Desde la creación de documentación de alta calidad hasta la mejora de proyectos con Clean Code, he demostrado compromiso con la excelencia. Diseños cautivadores en Adobe XD, aplicaciones multiplataforma, autenticación biométrica y API's REST son solo algunas áreas donde he dejado mi marca. Cada desafío tecnológico es una oportunidad para impulsar la innovación y transformar ideas en realidad."
  },
  {
    "job_position": "Desarrollador FullStack",
    "working_period": "Feb 2020 - Feb 2021",
    "job_enterprice": "TBTB GLOBAL",
    "job_enterprice_img": "https://pbs.twimg.com/profile_images/860196618209042432/KifSpWpu_400x400.jpg",
    "job_enterprice_link": "https://tbtb.global/",
    "skills": [
      "Angular",
      ".NET",
      "HTML5",
      "ClicData",
      "Adobe XD",
      "CSS3",
      "JavaScript",
      "Azure",
      "Ionic",
      "Postman",
      "Git",
      "TypeScript",
      "C#",
      "SQL Server"
    ],
    "description-business": "Somos TBTB Global, una empresa dedicada a ayudar a otras empresas a mejorar sus negocios y el estilo de vida de los pacientes que padecen cáncer y enfermedades raras.",
    "job_description": "Aprovechando mis conocimientos y habilidades, he sido un catalizador de soluciones en línea con las necesidades de la empresa, emergiendo como un destacado intérprete en múltiples frentes. Mi trayectoria se ha centrado en la optimización de procesos para potenciar la lógica funcional del software, la creación de experiencias cautivadoras en diseño UI & UX, el desarrollo versátil de aplicaciones multiplataforma abarcando Web, iOS y Android, así como el fortalecimiento de funciones relacionadas con la autenticación biométrica. Además, he dejado huella al diseñar y implementar eficaces API's REST, construir dinámicos dashboards interactivos y establecer bases de datos relacionales de alto rendimiento. Mi compromiso con estándares de calidad y buenas prácticas se refleja en cada paso del desarrollo, donde la aplicación ágil de metodologías impulsa resultados aún más impactantes."
  },
  {
    "job_position": "Desarrollador FullStack Tesis",
    "working_period": "Jun 2020 - Dic 2020",
    "job_enterprice": "Universidad de Cundinamarca",
    "job_enterprice_img": "https://pbs.twimg.com/profile_images/860196618209042432/KifSpWpu_400x400.jpg",
    "job_enterprice_link": "https://www.ucundinamarca.edu.co/",
    "skills": [
      "Laravel",
      "HTML5",
      "Adobe XD",
      "CSS3",
      "JavaScript",
      "Hostinger",
      "Git",
      "C#",
      "MySQL"
    ],
    "description-business": "Somos TBTB Global, una empresa dedicada a ayudar a otras empresas a mejorar sus negocios y el estilo de vida de los pacientes que padecen cáncer y enfermedades raras.",
    "job_description": "Como culminación de mi trayectoria académica en la Universidad de Cundinamarca, me sumergí en la creación de una asombrosa aplicación multiplataforma. Este proyecto de envergadura trae consigo un recorrido innovador por los tesoros turísticos de Fusagasugá. ¿La clave? Sumergirse en una experiencia de realidad virtual que revela secretos y encantos. El corazón de este logro reside en una Aplicación Web Progresiva (PWA) que se funde con un administrador, ofreciendo no solo información, sino también un análisis enriquecedor de cada rincón destacado. Un viaje más allá de lo convencional, es un placer presentar esta iniciativa que desafía los límites de la exploración y la tecnología."
  }
]
